app/Controllers/Ambulatoir.php

        $petId = $this->petModel->getInsertID();
        //dd($petId);

        $this->ambulatoirModel->save([
            'pet_id'=> $petId,
            'date_checkup' => $this->request->getVar('date'),
            'amnesa' => $this->request->getVar('amnesa'),
            'status_present' => $this->request->getVar('statusPresent'),
            'clinical_finding' => $this->request->getVar('temuanKlinis'),
            'diagnosis' => $this->request->getVar('diagnosa'),
            'medication' => $this->request->getVar('treatment')
        ]);
---
INSERT INTO `ambulatoir` (`pet_id`, `date_checkup`, `amnesa`, `status_present`, `clinical_finding`, `diagnosis`, `medication`, `created_at`, `updated_at`) VALUES (16, '2024-1-31 11:42:30', 'data baru', 'data baru', 'data baru', 'data baru', 'data baru', '2024-01-31 04:42:51', '2024-01-31 04:42:51')