app/Controllers/Ambulatoir.php

INSERT INTO `ambulatoir` (`pet_id`, `amnesa`, `status_present`, `clinical_finding`, `diagnosis`, `medication`, `hospitalized_status`, `created_at`, `updated_at`) VALUES (46, 'asdfasf', 'asfas', 'dfasdf', 'hgfd', 'hnbds', '0', '2024-09-18 04:39:12', '2024-09-18 04:39:12')
---
        //dd($petId);
        //dd($ambulatorId);

        $ambulatoirModel->save([
            'pet_id'=> $petId,
            'date_checkup' => $this->request->getVar('date'),
            'amnesa' => $this->request->getVar('amnesa'),
            'status_present' => $this->request->getVar('statusPresent'),
            'clinical_finding' => $this->request->getVar('temuanKlinis'),
            'diagnosis' => $this->request->getVar('diagnosa'),
            'medication' => $this->request->getVar('treatment'),
            'hospitalized_status'=>$this->request->getVar('rawatInap')
        ]);

INSERT INTO `rawat_inap` (`id_ambulatoir`, `id_petProfile`, `created_at`, `updated_at`) VALUES (58, 46, '2024-09-18 04:39:12', '2024-09-18 04:39:12')
---
        $hostpitalized = $this->request->getVar('rawatInap');


        $rawatInapModel->save([
            'id_ambulatoir' => $ambulatoirId,
            'id_petProfile' => $petId
        ]);