app/Controllers/PetList.php

SELECT *
FROM `ambulatoir`
WHERE `ambulatoir`.`pet_id` = '1'
---
    public function db_ambulatoir($id){
        $db = \Config\Database::connect();
        $builder = $db->table('ambulatoir');
        $builder->select('*');
        $builder->where('ambulatoir.pet_id',$id);
        $query = $builder->get();