app/Controllers/RawatInap.php

    public function db_fisiologis($id){
        $db = \Config\Database::connect();
        $builder = $db->table('fisiologis');
        $builder->select('fisiologis.*, rawat_inap.date_in_hospitalized, rawat_inap.prognosa, rawat_inap.medication_plan');
        $builder->join('rawat_inap', 'fisiologis.rawat_inap_id = rawat_inap.id');
        $builder->where('rawat_inap.id',$id);
        $query = $builder->get();
---
SELECT `fisiologis`.*, `rawat_inap`.`date_in_hospitalized`, `rawat_inap`.`prognosa`, `rawat_inap`.`medication_plan`
FROM `fisiologis`
JOIN `rawat_inap` ON `fisiologis`.`rawat_inap_id` = `rawat_inap`.`id`
WHERE `rawat_inap`.`id` = '3'