app/Models/AmbulatoirsModel.php

    public function getAmbulatoirDetailPet($id)
    {
        //return $this->where('ambulatoir.id',$id)->first();
        return $this->select('ambulatoir.*')
                    ->join('pet_profile as pp', 'ambulatoir.pet_id = pp.id')
                    ->where('pp.id',$id)->findAll();
---
SELECT `ambulatoir`.*
FROM `ambulatoir`
JOIN `pet_profile` as `pp` ON `ambulatoir`.`pet_id` = `pp`.`id`
WHERE `pp`.`id` = '1'

    public function getAmbulatoirAndPetList($id = false)
    {
        if ($id == false)
        {
            return $this->select('ambulatoir.*, pp.name, pp.owner_name')
                        ->join('pet_profile as pp', 'ambulatoir.pet_id = pp.id')
                        ->findAll();
        }
        return $this->select('ambulatoir.*, pp.*')
                    ->join('pet_profile as pp', 'ambulatoir.pet_id = pp.id')
                    ->where('ambulatoir.id',$id)->first();
---
SELECT `ambulatoir`.*, `pp`.`name`, `pp`.`owner_name`
FROM `ambulatoir`
JOIN `pet_profile` as `pp` ON `ambulatoir`.`pet_id` = `pp`.`id`
SELECT `ambulatoir`.*, `pp`.*
FROM `ambulatoir`
JOIN `pet_profile` as `pp` ON `ambulatoir`.`pet_id` = `pp`.`id`
WHERE `ambulatoir`.`id` = '2'
 LIMIT 1