app/Models/FisiologisModel.php

SELECT `fisiologis`.*
FROM `fisiologis`
JOIN `rawat_inap` as `r` ON `fisiologis`.`rawat_inap_id` = `r`.`id`
WHERE `r`.`id` = '6'
---
    public function getFisiologisHospilatizedPet($id)
    {
        //return $this->where('ambulatoir.id',$id)->first();
        return $this->select('fisiologis.*')
                    ->join('rawat_inap as r', 'fisiologis.rawat_inap_id = r.id')
                    ->where('r.id',$id)->findAll();

SELECT `fisiologis`.*
FROM `fisiologis`
JOIN `rawat_inap` as `r` ON `fisiologis`.`rawat_inap_id` = `r`.`id`
WHERE `fisiologis`.`date_rawatInap` LIKE '2024-10-10%' ESCAPE '!'
AND `r`.`id` = '6'
 LIMIT 1
---
    public function getFisiologiByDate($date, $id){
        $formattedDate = (new DateTime($date))->format('Y-m-d');

        log_message('info','Data Format'.$formattedDate);
        return $this->select('fisiologis.*')
            ->join('rawat_inap as r', 'fisiologis.rawat_inap_id = r.id')
            ->like('fisiologis.date_rawatInap', $formattedDate, 'after')
            ->where('r.id',$id)
            ->first();