app/Models/PetProfileModel.php

    public function getPetProfile($id = false)
    {
        if ($id == false)
        {
            return $this->findAll();
        }
        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `pet_profile`
SELECT *
FROM `pet_profile`
WHERE `id` = '1'
 LIMIT 1