app/Models/RawatInapModel.php

    public function getRawatInap($id = false)
    {
        if ($id == false)
        {
            return $this->select('rawat_inap.*,pp.name, pp.owner_name, pp.address')
                        ->join('ambulatoir as am', 'rawat_inap.id_ambulatoir = am.id')
                        ->join('pet_profile as pp', 'rawat_inap.id_petProfile = pp.id')
                        ->findAll();
        }
        return $this->select('rawat_inap.*, am.*, pp.*')
                    ->join('ambulatoir as am', 'rawat_inap.id_ambulatoir = am.id')
                    ->join('pet_profile as pp', 'rawat_inap.id_petProfile = pp.id')
                    ->where('rawat_inap.id',$id)->first();
---
SELECT `rawat_inap`.*, `pp`.`name`, `pp`.`owner_name`, `pp`.`address`, `am`.`amnesa`
FROM `rawat_inap`
JOIN `ambulatoir` as `am` ON `rawat_inap`.`id_ambulatoir` = `am`.`id`
JOIN `pet_profile` as `pp` ON `rawat_inap`.`id_petProfile` = `pp`.`id`
SELECT `rawat_inap`.*, `am`.*, `pp`.*
FROM `rawat_inap`
JOIN `ambulatoir` as `am` ON `rawat_inap`.`id_ambulatoir` = `am`.`id`
JOIN `pet_profile` as `pp` ON `rawat_inap`.`id_petProfile` = `pp`.`id`
WHERE `rawat_inap`.`id` = '6'
 LIMIT 1